read_verilog -formal fib_14.v
prep -top top
flatten
memory -nomap
hierarchy -check
setundef -undriven -init -expose
sim -clock clk  -reset rst -n 1 -w top
write_btor  -s fib_14.btor
