read_verilog -formal fib_07.v
prep -top top
flatten
memory -nordff
setundef -undriven -init -expose
sim -clock clk  -reset rst -n 1 -w top
delete -output
techmap
abc -fast -g AND
write_aiger -zinit fib_07.aig
