read_verilog -formal 46.c.v
prep -top top
flatten
memory -nomap
hierarchy -check
setundef -undriven -init -expose
sim -clock clk  -reset rst -n 1 -w top
write_btor  -s 46.c.btor
