read_verilog -formal jmbl_sum4.v
prep -top top
flatten
memory -nomap
hierarchy -check
setundef -undriven -init -expose
sim -clock clk  -reset rst -n 1 -w top
write_btor  -s jmbl_sum4.btor
